src/Catalogs/ПлощадкиЭксплуатации/ПлощадкиЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПлощадкиЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ЕдиницаКонтроля</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипЭлементаПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/НастройкиКонтрольПроизводительности/НастройкиКонтрольПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПроизводительности</name>
  <resources>
    <name>ОповещатьПриУхудшенииАпдекса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПороговоеЗначениеПадения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогФайловОценкиПроизводительности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПлощадкиЭксплуатации/Forms/ФормаГруппыКонтрольПроизводительности/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();    
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект));
    
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    Настройки = РегистрыСведений.НастройкиКонтрольПроизводительности.ПрочитатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПроизводительности());
        
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогФайловОценкиПроизводительности";
    НовСтрока.ПараметрПредставление = "Каталог файлов оценки производительности";
    НовСтрока.ПараметрЗначение = Настройки.КаталогФайловОценкиПроизводительности;
    
    ЭтотОбъект.Расписание = Настройки.Расписание;
    Если ЭтотОбъект.Расписание = Неопределено Тогда
        ЭтотОбъект.Расписание = Новый РасписаниеРегламентногоЗадания;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
    КонецЦикла;
    
    Настройки.Вставить("Расписание", ЭтотОбъект.Расписание);
    
    РегистрыСведений.НастройкиКонтрольПроизводительности.ЗаписатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПроизводительности(), Настройки);
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, Неопределен) Экспорт
    
    Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект.Расписание = НовоеРасписание;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
